Enums/ТелеграмВидыСравнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТелеграмВидыСравнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Больше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БольшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Меньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеньшеИлиРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачинаетсяС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРавно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСодержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подобно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Содержит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоответствуетШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТелеграмВидыСравнения/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("Назначение") = Истина Тогда
		Назначение = Параметры.Назначение;
	Иначе
		Назначение = Неопределено;
	КонецЕсли;
	
	ВидыСравнения = Перечисления.ТелеграмВидыСравнения;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если Назначение = "Условия" Тогда
		ДанныеВыбора.Добавить(ВидыСравнения.НачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеНачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеРавно);
		ДанныеВыбора.Добавить(ВидыСравнения.НеСодержит);
		ДанныеВыбора.Добавить(ВидыСравнения.Равно);
		ДанныеВыбора.Добавить(ВидыСравнения.Содержит);
	ИначеЕсли Назначение = "ВходящийТекст" ИЛИ Назначение = "ВходящиеДанные" Тогда
		ДанныеВыбора.Добавить(ВидыСравнения.Заполнено);
		ДанныеВыбора.Добавить(ВидыСравнения.НеЗаполнено);
		ДанныеВыбора.Добавить(ВидыСравнения.НачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеНачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеРавно);
		ДанныеВыбора.Добавить(ВидыСравнения.НеСодержит);
		ДанныеВыбора.Добавить(ВидыСравнения.Равно);
		ДанныеВыбора.Добавить(ВидыСравнения.Содержит);
	Иначе // Контекст, ВходящийТекст, НЕОПРЕДЕЛЕНО
		ДанныеВыбора.Добавить(ВидыСравнения.Больше);
		ДанныеВыбора.Добавить(ВидыСравнения.БольшеИлиРавно);
		ДанныеВыбора.Добавить(ВидыСравнения.Заполнено);
		ДанныеВыбора.Добавить(ВидыСравнения.Меньше);
		ДанныеВыбора.Добавить(ВидыСравнения.МеньшеИлиРавно);
		ДанныеВыбора.Добавить(ВидыСравнения.НачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеЗаполнено);
		ДанныеВыбора.Добавить(ВидыСравнения.НеНачинаетсяС);
		ДанныеВыбора.Добавить(ВидыСравнения.НеРавно);
		ДанныеВыбора.Добавить(ВидыСравнения.НеСодержит);
		ДанныеВыбора.Добавить(ВидыСравнения.Равно);
		ДанныеВыбора.Добавить(ВидыСравнения.Содержит);
	КонецЕсли;
	
КонецПроцедуры
